{"id":65,"date":"2022-12-09T23:57:42","date_gmt":"2022-12-09T23:57:42","guid":{"rendered":"https:\/\/www.sportdown.com\/?p=65"},"modified":"2024-05-02T23:58:17","modified_gmt":"2024-05-02T23:58:17","slug":"2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results","status":"publish","type":"post","link":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/","title":{"rendered":"2022 Wrangler NFR Las Vegas 6th go-round highlights &#038; results"},"content":{"rendered":"<p>In Round 6, Wright earned $22,851 in saddle bronc riding with a second-place 87-point ride on Bar T Rodeo’s Jitterbug and $22,851 for his second-place 86.5-point bull ride on Four Star Rodeo’s Bit A Bad News. He earned $209,405 at the 2022 NFR.<\/p>\n<p>“When you break your record, it means you did better than the year before, whenever you set it,” said Wright, 23. “The way I look at it is that I’m improving every year, and to improve just from last year is pretty special and I’m just happy with the way things are going.”<\/p>\n<p>Wright has now won four career all-around titles in 2019-22. Wright also won bull riding and saddle bronc riding world championships in 2020 and 2021, respectively.<\/p>\n<p>Wright is also on the brink of surpassing the bull riding and all-around single-season earnings marks.<\/p>\n<p>Wright has earned $451,850 in bull riding and $563,661 in all-around. Sage Kimzey owns the single-season bull riding earnings mark at $480,797, including ground money, which he set in 2019. A year ago, Wright established the all-around season earnings mark at $585,850.<\/p>\n<p>“That’s when I say I just choose to have fun, and it is fun and I love rodeo,” Wright said. “And I feel like when you’re having fun it’s easier to break records because you’re loving what you do and I’m loving everything about everything.”<\/p>\n<p>Wright has a simple approach to the remaining four rounds of the NFR.<\/p>\n<p>“Same thing – I’m just having fun,” Wright said. “I’m not worried about not a single gold buckle right now. I’m just worried about making 90-point rides.”<\/p>\n<p><strong>Tie-down roper Shad Mayfield matches arena record with a Round 6 victory<\/strong><\/p>\n<p>Shad Mayfield, the 2020 PRCA World Champion Tie-Down Roper, was electric on Tuesday at the Thomas &amp; Mack Center.<\/p>\n<p>The Clovis, N.M., cowboy stopped the clock in 6.5 seconds tying the arena record. ProRodeo Hall of Famers – Cody Ohl (6.5 seconds, Round 10, 2003) and Trevor Brazile (6.5 seconds, Round 8, 2015) also accomplished the feat.<\/p>\n<p>“I feel so good, the energy of the fans after that,” he said. “That’s something I’ve always dreamed of, throwing my hat like Cody Ohl used to, being 6.5 I mean that’s just something I’ve dreamed about.”<\/p>\n<p>That record run was something Mayfield was trying to digest.<\/p>\n<p>“I can’t even explain it, I didn’t even flank the calf all the way, I mean, if I had a better flank no telling what could have been,” said Mayfield, 21. “But I feel like my horse made it so easy, and to have a good calf I just had to do my part. Once I heard them holler ‘you’re out’ I just let my rope go. Tonight, I had to take it back to just like I’m at home practicing or any jackpot.”<\/p>\n<p>Mayfield edged John Douch by a mere one-tenth of a second for the round win.<\/p>\n<p>“Honestly it just pumped me up hearing the crowd and doing all that,” Mayfield said. “I love that feeling of coming behind someone and being faster, and it’s not easy beating someone at 6.6, so I got it done so that’s what makes it even better.”<\/p>\n<p><strong>Saddle bronc rider Logan Hay wins back-to-back rounds<\/strong><\/p>\n<p>Logan Hay made it back-to-back victory laps.<\/p>\n<p>After winning Round 5, Hay made it two in a row capturing the Round 6 win with an 87.5-point ride on Frontier Rodeo’s Yellowstone.<\/p>\n<p>“Yeah, it was our hoppers out again today and Yellowstone didn’t go in Round 1, so I was happy to have one that was fresh,” said Hay, 25. “I knew it was a good draw and I just tried to do my job.”<\/p>\n<p>Hay, who is making his NFR debut, is the son of saddle bronc rider Rod Hay, a 20-time NFR qualifier, and older brother to fellow NFR saddle bronc rider Dawson.<\/p>\n<p>“I’ve been blessed that it’s been working out,” Logan said. “I’m just trying to take it one horse at a time and not let my nerves get the best of me. I’ve just felt at home here. I think it’s all the other Canadians and my dad here helping me in the chutes that made it feel this way. I love it.”<\/p>\n<p>“I’m looking to just stick to my game plan. Take it one horse at a time. I don’t like to think about anything else. I’ve hardly looked at the world standings, to be honest. I look at it as me versus my horse, get up to see what (score) I got, and watch a few videos. That’s just what my game plan is.”<\/p>\n<p><strong>Bull rider Tristen Hutchings makes it three round wins at the 2022 NFR<\/strong><\/p>\n<p>When cowboys make their NFR debuts they make memories for a lifetime.<\/p>\n<p>That has been the case for bull rider Tristen Hutchings.<\/p>\n<p>The Monteview, Idaho, the cowboy has won three of the first six rounds in his first career trip to the NFR.<\/p>\n<p>Hutchings’ latest claim to glory came on Tuesday when he won Round 6 with an 88-point ride on Rocky Mountain Rodeo’s Caddyshack. Hutchings also was tops in Round 1 and Round 5.<\/p>\n<p>“Yeah, I had a really good bull tonight,” Hutchings said. “It was a bull that I’d been wanting to get on for a while now and he had me loosen up a little bit and took me for a ride. Finally, in the end, I got a good seat. It was good, it was fun, and there’s no better place to win than here.”<\/p>\n<p>Hutchings thought he could take victory laps at the NFR based on his late-season surge.<\/p>\n<p>“At the end of the season, I got on a heater, and I think it’s carried into here,” he said. “I didn’t ever slow down getting on practice bulls or putting in the work at the gym. So, this is exactly what I’ve thought about and dreamed about. It’s life-changing money and there are a ton of nerves but at the end of the day, it’s about having fun. That’s when I think most bull riders are at their best.<\/p>\n<p>“You have to draw right to come in here and win three, especially in the first six nights. It’s something you think is possible, but I was just hoping to come in here and ride as many bulls as possible. That’s the only game plan I had in my head.”<\/p>\n<p><strong>Rookie bareback rider Rocker Steiner captures Round 6 title<\/strong><\/p>\n<p>This wasn’t the script rookie Rocker Steiner had envisioned – until Tuesday.<\/p>\n<p>Steiner had an 88.5-point ride aboard Wayne Vold Rodeo’s True Grit to win Round 6.<\/p>\n<p>“It is always great to get a win, especially at the NFR,” said Steiner, 18. “My dad won here, and my mom won here, and it is great to win in the same place where your parents won.”<\/p>\n<p>Steiner, who placed in just one of the first five rounds, splitting fifth in Round 5, took a moment to describe his winning ride.<\/p>\n<p>“That was a really fast, snappy, droppy (horse), it is not easy to ride,” Steiner said. “You have to need speed to ride that horse. That horse bucked me off in Strathmore (Alberta) and it is just not an easy horse to ride.”<\/p>\n<p>Their emotions about Steiner have been well-documented at this year’s NFR, but he is not about to change his ways.<\/p>\n<p>“I think you all can tell I’m competitive,” Steiner said. “I didn’t come here for second place. I didn’t come here to get a low score. I’m not going for third or fourth. I’m going to win. It is hard to hide my passion and my emotions. I just want to win.<\/p>\n<p>“I’m going to go to South Point and get a buckle and hang out with my family. We are going to have a big crew on stage. There have been a lot of people with me my whole career and hopefully, I will get everybody on stage who has been part of it.”<\/p>\n<p>Steiner, who bought his PRCA card on Jan. 10, is following the rodeo footsteps of his grandfather Bobby Steiner, who won a PRCA Bull Riding World Championship in 1973, and his father, Sid, the 2002 PRCA Steer Wrestling World Champion.<\/p>\n<p><strong>Steer wrestler Tristan Martin scores a Round 6 victory<\/strong><\/p>\n<p>Steer wrestler Tristan Martin experienced the highs and lows of rodeo in 24 hours. The Sulphur, La., the cowboy had a no-time in Round 5 and then on Tuesday, he won Round 6 with a 3.5-second time.<\/p>\n<p>“They had missed him in the first round, but I had seen some videos on him, so I knew if I did my job, I had a good chance,” Martin said.<\/p>\n<p>Martin’s run came after a 15-minute delay because of a power outage in the Thomas &amp; Mack Center, which caused him to reel things in.<\/p>\n<p>“Well, I was pretty amped up before the power went out, so I think it was just what I needed to help me calm back down and make a good run,” he said.<\/p>\n<p><strong>RELATED<\/strong>: <a href=\"https:\/\/web.archive.org\/web\/20231003183403\/https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-1st-go-round-results\/\">2022 Wrangler NFR Las Vegas 1st go-round results<\/a><\/p>\n<p><strong>RELATED<\/strong>: <a href=\"https:\/\/web.archive.org\/web\/20231003183403\/https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-round-2-results-highlights\/\">2022 Wrangler NFR Round 2 Results &amp; Highlights<\/a><\/p>\n<p><strong>Team ropers Chad Masters\/Joseph Harrison claim the Round 6 crown<\/strong><\/p>\n<p>Team ropers Chad Masters\/Joseph Harrison had not had much luck at the 2022 Wrangler NFR. Masters\/Harrison split fourth in Round 3.<\/p>\n<p>The duo’s fortunes changed on Tuesday. Masters\/Harrison won Round 6 with a 4.0-second time.<\/p>\n<p>“I’m so happy I just turned a decent steer for my partner,” Masters said. “He did a good job; he made the whole run come together.”<\/p>\n<p>Harrison was excited about the result.<\/p>\n<p>“It was a good steer, man,” he said. “We talked about him beforehand, and we both liked him. Chad did what he does, man, he put it on the horns and made the steer hit nice where I could get me a good clean fast throw at him. And I’m not trying to be smart, but it’s supposed to work out like that.”<\/p>\n<p><strong>Barrel racers Pozzi Tonozzi, and Beisel split Round 6 victory<\/strong><\/p>\n<p>Emily Beisel and Brittany Pozzi Tonozzi shared glory on Tuesday.<\/p>\n<p>They clocked identically 13.57 times for the Round 6 win.<\/p>\n<p>“It’s great to see my horse working like he’s working,” said Beisel, who also won Round 4. “The biggest thing is I’ve got to get him around them and he will take care of the rest. Last night, I had a little mishap on the backside of the second barrel and tonight I took slightly bigger circles with a tighter cinch. It’s awesome to be here, especially being 14th on the ground. It’s incredible.”<\/p>\n<p>Pozzi Tonozzi was thrilled to be celebrating her first-round win in 11 years.<\/p>\n<p>“I forgot what it feels like and how good it feels to win a round,” she said. “I’ve qualified on several horses since the last time I won including my big, yellow horse Duke. This one is so special because it’s a horse I’ve raised and trained, and she’s now owned by Teton Ridge. I’m just excited to be here and can’t wait for the next round.”<\/p>\n<p><strong>RELATED<\/strong>: <a href=\"https:\/\/web.archive.org\/web\/20231003183403\/https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-3rd-go-round-highlights-results\/\">2022 Wrangler NFR Las Vegas 3rd go-round highlights &amp; results<\/a><\/p>\n<p><strong>RELATED<\/strong>: <a href=\"https:\/\/web.archive.org\/web\/20231003183403\/https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-4th-go-round-highlights-results\/\">2022 Wrangler NFR Las Vegas 4th go-round highlights &amp; results<\/a><\/p>\n<p><strong>RELATED<\/strong>: <a href=\"https:\/\/web.archive.org\/web\/20231003183403\/https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-5th-go-round-highlights-results\/\">2022 Wrangler NFR Las Vegas 5th go-round highlights &amp; results<\/a><\/p>\n<p><strong>2022 Wrangler National Finals Rodeo Results<br \/>\nRound 6, Dec. 6<br \/>\nThomas &amp; Mack Center, Las Vegas, Nev.<\/strong><\/p>\n<p><strong>Bareback Riding:<\/strong> Sixth round: 1. Rocker Steiner, 88.5 points on Wayne Vold Rodeo’s True Grit, $28,914; 2. Tanner Aus, 88, $22,851; 3. Leighton Berry, 87.5, $17,255; 4. Cole Franks, 87, $12,125; 5. (tie) Kaycee Feild and R.C. Landingham, 86.5, $6,063 each; 7. Cole Reiner, 85.5; 8. (tie) Jess Pope, Tilden Hooper, and Clayton Biglow, 85; 11. Ty Breuer, 84; 12. Garrett Shadbolt, 82; 13. Tim O’Connell, 81; 14. Caleb Bennett, 79; 15. Orin Larsen, Out. <strong>Average leaders:<\/strong> 1. Jess Pope, 517 points on six heads; 2. R.C. Landingham, 513.5; 3. Cole Reiner, 508.5; 4. (tie) Kaycee Feild and Cole Franks, 507.5; 6. (tie) Tim O’Connell and Rocker Steiner, 505; 8. Clayton Biglow, 503.5; 9. Leighton Berry, 497; 10. Ty Breuer, 495; 11. Garrett Shadbolt, 484; 12. Caleb Bennett, 473.5; 13. Tilden Hooper, 424 points on five heads; 14. Tanner Aus, 407; 15. Orin Larsen, 217.5 points on three heads. <strong>World standings:<\/strong> 1. Jess Pope, $262,063; 2. Cole Reiner, $207,346; 3. Leighton Berry, $201,052; 4. R.C. Landingham, $194,309; 5. Kaycee Feild, $194,306; 6. Tanner Aus, $180,036; 7. Rocker Steiner, $179,304; 8. Tim O’Connell, $172,440; 9. Cole Franks, $172,284; 10. Tilden Hooper, $166,559; 11. Caleb Bennett, $163,353; 12. Clayton Biglow, $142,671; 13. Garrett Shadbolt, $134,002; 14. Orin Larsen, $133,784; 15. Ty Breuer, $115,749.<\/p>\n<p><strong>Steer Wrestling: <\/strong>Sixth round: 1. Tristan Martin, 3.5 seconds, $28,914; 2. Will Lummus, 3.8, $22,851; 3. (tie) Tanner Brunner and Nick Guy, 3.9, $14,690 each; 5. J.D. Struxness, 4.0, $7,462; 6. (tie) Dakota Eldridge and Timmy Sparing, 4.1, $2,332 each; 8. Rowdy Parrott, 4.2; 9. (tie) Ty Erickson and Jesse Brown, 4.5; 11. Tyler Waguespack, 4.7; 12. (tie) Stetson Jorgensen, Hunter Cure, 4.8; 14. Kyle Irwin, 5.3; 15. Dirk Tavenner, 5.4. Average leaders: 1. Kyle Irwin, 27.9 seconds on six head; 2. Rowdy Parrott, 28.1; 3. Jesse Brown, 29.3; 4. Tyler Waguespack, 29.9; 5. Will Lummus, 34.6; 6. Stetson Jorgensen, 41.9; 7. Tanner Brunner, 51.3; 8. Tristan Martin, 21.6 seconds on five head; 9. Hunter Cure, 22.1; 10. Ty Erickson, 23.6; 11. Dakota Eldridge, 25.0; 12. J.D. Struxness, 25.3; 13. Timmy Sparing, 32.8; 14. Nick Guy, 33.3; 15. Dirk Tavenner, 36.8. World standings: 1. Stetson Jorgensen, $233,733; 2. Will Lummus, $205,330; 3. Hunter Cure, $177,357; 4. Tyler Waguespack, $175,844; 5. Tristan Martin, $166,318; 6. Ty Erickson, $158,823; 7. Kyle Irwin, $156,155; 8. J.D. Struxness, $148,572; 9. Dakota Eldridge, $140,913; 10. Nick Guy, $131,625; 11. Jesse Brown, $129,228; 12. Tanner Brunner, $120,961; 13. Rowdy Parrott, $119,578; 14. Dirk Tavenner, $94,532; 15. Timmy Sparing, $93,644.<\/p>\n<p><strong>Team Roping:<\/strong> Sixth round: 1. Chad Masters\/Joseph Harrison, 4.0 seconds, $28,914 each; 2. Lightning Aguilera\/Jonathan Torres, 4.1, $22,851; 3. Tanner Tomlinson\/Patrick Smith, 4.3, $17,255; 4. Jr. Dees\/Levi Lord, 4.7, $12,125; 5. Tyler Wade\/Trey Yates, 8.6, $7,462; 6. Dustin Egusquiza\/Travis Graves, 8.9, $4,664; 7. Cody Snow\/Wesley Thorp, 9.0; 8. Clay Tryan\/Jade Corkill, 9.1; 9. Jake Orman\/Brye Crites, 9.2; 10. Kaleb Driggers\/Junior Nogueira, 9.9; 11. Riley Minor\/Brady Minor, 14.4; 12. (tie) Coleman Proctor\/Logan Medlin, Andrew Ward\/Buddy Hawkins II, Rhen Richard\/Jeremy Buhler, and Clay Smith\/Jake Long, NT. Average leaders: 1. Tanner Tomlinson\/Patrick Smith, 31.6 seconds on six head; 2. Coleman Proctor\/Logan Medlin, 31.8 seconds on five heads; 3. Jr. Dees\/Levi Lord, 32.2; 4. Kaleb Driggers\/Junior Nogueira, 37.9; 5. Riley Minor\/Brady Minor, 44.5; 6. Andrew Ward\/Buddy Hawkins II, 20.6 seconds on four heads; 7. Tyler Wade\/Trey Yates, 22.7; 8. Jake Orman\/Brye Crites, 22.9; 9. Dustin Egusquiza\/Travis Graves, 25.5; 10. Clay Tryan\/Jade Corkill, 26.5; 11. Chad Masters\/Joseph Harrison, 17.6 seconds on three head; 12. Cody Snow\/Wesley Thorp, 19.2; 13. Lightning Aguilera\/Jonathan Torres, 23.2; 14. Clay Smith\/Jake Long, 46.1; 15. Rhen Richard\/Jeremy Buhler, 14.2 seconds on two heads. <strong>World standings (headers):<\/strong> 1. Kaleb Driggers, $274,486; 2. Clay Tryan, $203,397; 3. Tanner Tomlinson, $197,814; 4. Andrew Ward, $177,056; 5. Jr. Dees, $169,857; 6. Dustin Egusquiza, $160,792; 7. Coleman Proctor, $159,321; 8. Tyler Wade, $144,948; 9. Lightning Aguilera, $137,963; 10. Chad Masters, $134,441; 11. Clay Smith, $127,765; 12. Rhen Richard, $126,533; 13. Jake Orman, $125,380; 14. Cody Snow, $113,968; 15. Riley Minor, $103,686. <strong>World standings (heeler):<\/strong> 1. Junior Nogueira, $274,486; 2. Patrick Smith, $197,814; 3. Buddy Hawkins II, $175,514; 4. Levi Lord, $171,255; 5. Jade Corkill, $169,589; 6. Jake Long, $169,245; 7. Travis Graves, $161,506; 8. Logan Medlin, $159,321; 9. Trey Yates, $141,386; 10. Joseph Harrison, $139,112; 11. Jonathan Torres, $130,509; 12. Jeremy Buhler, $127,469; 13. Brye Crites, $126,722; 14. Wesley Thorp, $113,968; 15. Brady Minor, $103,686.<\/p>\n<p><strong>Saddle Bronc Riding<\/strong>: Sixth round: 1. Logan Hay, 87.5 points on Frontier Rodeo’s Yellowstone, $28,914; 2. Stetson Wright, 87, $22,851; 3. Zeke Thurston, 86, $17,255; 4. Layton Green, 85.5, $12,125; 5. Wyatt Casper, 85, $7,462; 6. Kolby Wanchuk, 84.5, $4,664; 7. Brody Cress, 84; 8. (tie) Sage Newman, Kole Ashbacher, and Tanner Butner, 82.5; 11. Dawson Hay, 82; 12. Kade Bruno, 81.5; 13. (tie) Ryder Wright, Lefty Holman, and Chase Brooks, NS. Average leaders: 1. Zeke Thurston, 521 points on six heads; 2. Stetson Wright, 519; 3. Logan Hay, 513.5; 4. Kolby Wanchuk, 511.5; 5. Wyatt Casper, 496.5; 6. Tanner Butner, 494; 7. Kole Ashbacher, 493; 8. Brody Cress, 485; 9. Lefty Holman, 434.5 points on five heads; 10. Dawson Hay, 423; 11. Sage Newman, 421; 12. Kade Bruno, 417; 13. Chase Brooks, 339 points on four heads; 14. Layton Green, 336; 15. Ryder Wright, 330. <strong>World standings<\/strong>: 1. Sage Newman, $308,349; 2. Stetson Wright, $270,974; 3. Lefty Holman, $249,052; 4. Zeke Thurston, $239,802; 5. Logan Hay, $232,140; 6. Brody Cress, $198,707; 7. Ryder Wright, $186,610; 8. Kolby Wanchuk, $181,631; 9. Layton Green, $175,808; 10. Chase Brooks, $161,533; 11. Kade Bruno, $153,789; 12. Dawson Hay, $147,833; 13. Wyatt Casper, $145,150; 14. Tanner Butner, $133,481; 15. Kole Ashbacher, $127,543.<\/p>\n<p><strong>Tie-Down Roping:<\/strong> Sixth round: 1. Shad Mayfield, 6.5 seconds, $28,914; 2. John Douch, 6.6, $22,851; 3. Caleb Smidt, 7.5, $17,255; 4. Riley Webb, 7.7, $12,125; 5. Macon Murphy, 7.8, $7,462; 6. Cory Solomon, 8.0, $4,664; 7. Zack Jongbloed, 8.5; 8. Marty Yates, 9.3; 9. Shane Hanchey, 9.4; 10. Hunter Herrin, 10.2; 11. Ty Harris, 11.3; 12. Tyler Milligan, 13.8; 13. Haven Meged, 18.0; 14. (tie) Tuf Cooper and Kincade Henry, NT. <strong>Average leaders:<\/strong> 1. Caleb Smidt, 45.7 seconds on six head; 2. Riley Webb, 55.3; 3. Cory Solomon, 56.3; 4. Zack Jongbloed, 57.2; 5. Haven Meged, 61.1; 6. Macon Murphy, 63.9; 7. Shad Mayfield, 65.2; 8. Shane Hanchey, 68.1; 9. Ty Harris, 68.4; 10. Tyler Milligan, 72.1; 11. Marty Yates, 43.9 seconds on five head; 12. Hunter Herrin, 56.4; 13. Kincade Henry, 31.2 seconds on four head; 14. John Douch, 21.8 seconds on three head; 15. Tuf Cooper, 26.1 seconds on two heads. <strong>World standings:<\/strong> 1. Caleb Smidt, $276,337; 2. Shad Mayfield, $265,273; 3. John Douch, $237,121; 4. Haven Meged, $188,257; 5. Kincade Henry, $188,194; 6. Marty Yates, $187,068; 7. Riley Webb, $181,136; 8. Cory Solomon, $172,965; 9. Hunter Herrin, $159,280; 10. Shane Hanchey, $154,908; 11. Zack Jongbloed, $146,755; 12. Tyler Milligan, $135,703; 13. Tuf Cooper, $134,382; 14. Macon Murphy, $130,717; 15. Ty Harris, $128,937.<\/p>\n<p>B<strong>arrel Racing: <\/strong>Sixth round: 1. (tie) Emily Beisel and Brittany Pozzi Tonozzi, 13.57 seconds, $25,882 each; 3. Bayleigh Choate, 13.63, $17,255; 4. Lisa Lockhart, 13.64, $12,125; 5. Jessica Routier, 13.65, $7,462; 6. Shelley Morgan, 13.70, $4,664; 7. Wenda Johnson, 13.76; 8. Dona Kay Rule, 13.78; 9. Sissy Winn, 13.85; 10. Leslie Small, 18.54; 11. Jordon Briggs, 18.70; 12. Margo Crowther, 18.78; 13. (tie) Stevi Hillman and Hailey Kinsel, 18.83; 15. Kassie Mowry, 19.14. Average leaders: 1. Lisa Lockhart, 82.35 seconds on six runs; 2. Shelley Morgan, 82.94; 3. Wenda Johnson, 82.95; 4. Sissy Winn, 83.66; 5. Bayleigh Choate, 83.88; 6. Jordon Briggs, 87.64; 7. Margo Crowther, 87.77; 8. Brittany Pozzi Tonozzi, 87.94; 9. Dona Kay Rule, 88.57; 10. Jessica Routier, 89.05; 11. Hailey Kinsel, 92.10; 12. Leslie Small, 92.50; 13. Kassie Mowry, 92.92; 14. Emily Beisel, 96.38; 15. Stevi Hillman, 98.49. World standings: 1. Hailey Kinsel, $225,225; 2. Jordon Briggs, $222,289; 3. Lisa Lockhart, $182,312; 4. Wenda Johnson, $177,763; 5. Emily Beisel, $166,222; 6. Dona Kay Rule, $164,956; 7. Shelley Morgan, $151,706; 8. Margo Crowther, $149,775; 9. Kassie Mowry, $142,659; 10. Stevi Hillman, $138,064; 11. Brittany Pozzi Tonozzi, $133,641; 12. Sissy Winn, $119,310; 13. Bayleigh Choate, $118,148; 14. Jessica Routier, $108,988; 15. Leslie Small, $106,578.<\/p>\n<p><strong>Bull Riding:<\/strong> Sixth round: 1. Tristen Hutchings, 88 points on Rocky Mountain Rodeo’s Caddyshack, $28,914; 2. Stetson Wright, 86.5, $22,851; 3. (tie) Josh Frost and Trevor Kastner, 85.5, $14,690 each; 5. Garrett Smith, 84, $7,462; 6. (tie) Ky Hamilton and Creek Young, 82.5, $2,332 each. 8. Cole Fischer, 74; 9. (tie) Jeff Askey, Maverick Potter, Trey Kimzey, Jared Parsonage, Trey Holston, JR Stratford, Lukasey Morris, Reid Oftedahl, NS. Average leaders: 1. Stetson Wright, 436.5 points on five heads; 2. Josh Frost, 434.5; 3. Trevor Kastner, 338.5 points on four heads; 4. Ky Hamilton, 332; 5. Tristen Hutchings, 269 points on three heads; 6. Trey Kimzey, 261; 7. Garrett Smith, 256.5; 8. Creek Young, 169 points on two heads; 9. Cole Fischer, 159.5; 10. (tie) Jeff Askey and JR Stratford, 90 points on one head; 12. Jared Parsonage, 81.5; 13. (tie) Maverick Potter, Trey Holston, Lukasey Morris, Reid Oftedahl, NS. World standings: 1. Stetson Wright, $451,850; 2. Josh Frost, $315,738; 3. Tristen Hutchings, $227,756; 4. Jeff Askey, $216,848; 5. Trevor Kastner, $192,999; 6. Ky Hamilton, $185,841; 7. Garrett Smith, $185,002; 8. Trey Kimzey, $168,189; 9. JR Stratford, $142,943; 10. Creek Young, $127,692; 11. Maverick Potter, $126,065; 12. Jared Parsonage, $122,314; 13. Trey Holston, $118,892; 14. Cole Fischer, $110,994; 15. Lukas Morris, $110,667; 16 Reid Oftedahl, $107,944.<\/p>\n<p><strong>All-Around:<\/strong> 1. Stetson Wright, $563,661; 2. Caleb Smidt, $274,565; 3. Josh Frost, $222,825; 4. Marty Yates, $184,694; 5. Haven Meged, $174,666; 6. Coleman Proctor, $164,487; 7. Taylor Santos, $159,179; 8. Zack Jongbloed, $148,053; 9. Rhen Richard, $129,783; 10. Paul David Tierney, $118,792.<\/p>\n<p><strong>Top Gun Leaders:<\/strong> 1. Caleb Smidt, $126,821; 2. Stetson Wright, $107,467; 3. Hailey Kinsel, $105,835; 4. Jess Pope, $102,804; 5. (tie) Stetson Jorgensen and Lefty Holman, $99,073 each; 7. Lisa Lockhart, $97,441; 8. Tristen Hutchings, $96,741; 9. Zeke Thurston, $95,964; 10. Logan Hay, $92,699.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In Round 6, Wright earned $22,851 in saddle bronc riding with a second-place 87-point ride on Bar T Rodeo’s Jitterbug and $22,851 for his second-place 86.5-point bull ride on Four Star Rodeo’s Bit A Bad News. He earned $209,405 at the 2022 NFR. “When you break your record, it means you did better than the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-65","1":"post","2":"type-post","3":"status-publish","4":"format-standard","6":"category-news","7":"entry"},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v26.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>2022 Wrangler NFR Las Vegas 6th go-round highlights &amp; results - NFR Latest News<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"2022 Wrangler NFR Las Vegas 6th go-round highlights &amp; results - NFR Latest News\" \/>\n<meta property=\"og:description\" content=\"In Round 6, Wright earned $22,851 in saddle bronc riding with a second-place 87-point ride on Bar T Rodeo’s Jitterbug and $22,851 for his second-place 86.5-point bull ride on Four Star Rodeo’s Bit A Bad News. He earned $209,405 at the 2022 NFR. “When you break your record, it means you did better than the [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\" \/>\n<meta property=\"og:site_name\" content=\"NFR Live Free 2025 National Finals Rodeo\" \/>\n<meta property=\"article:published_time\" content=\"2022-12-09T23:57:42+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-02T23:58:17+00:00\" \/>\n<meta name=\"author\" content=\"SportDown\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"SportDown\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"16 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\"},\"author\":{\"name\":\"SportDown\",\"@id\":\"https:\/\/www.sportdown.com\/#\/schema\/person\/bde5a067801ef53785224c8062eb80ce\"},\"headline\":\"2022 Wrangler NFR Las Vegas 6th go-round highlights &#038; results\",\"datePublished\":\"2022-12-09T23:57:42+00:00\",\"dateModified\":\"2024-05-02T23:58:17+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\"},\"wordCount\":2932,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.sportdown.com\/#organization\"},\"articleSection\":[\"News\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\",\"url\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\",\"name\":\"2022 Wrangler NFR Las Vegas 6th go-round highlights & results - NFR Latest News\",\"isPartOf\":{\"@id\":\"https:\/\/www.sportdown.com\/#website\"},\"datePublished\":\"2022-12-09T23:57:42+00:00\",\"dateModified\":\"2024-05-02T23:58:17+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.sportdown.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"2022 Wrangler NFR Las Vegas 6th go-round highlights &#038; results\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sportdown.com\/#website\",\"url\":\"https:\/\/www.sportdown.com\/\",\"name\":\"Watch NFR Live Free 2024 National Finals Rodeo Online\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.sportdown.com\/#organization\"},\"alternateName\":\"NFR Live Free\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sportdown.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.sportdown.com\/#organization\",\"name\":\"NFR Live\",\"url\":\"https:\/\/www.sportdown.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sportdown.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.sportdown.com\/wp-content\/uploads\/2024\/05\/cropped-wrangler-national-finals-rodeo-site-icon.png\",\"contentUrl\":\"https:\/\/www.sportdown.com\/wp-content\/uploads\/2024\/05\/cropped-wrangler-national-finals-rodeo-site-icon.png\",\"width\":512,\"height\":512,\"caption\":\"NFR Live\"},\"image\":{\"@id\":\"https:\/\/www.sportdown.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sportdown.com\/#\/schema\/person\/bde5a067801ef53785224c8062eb80ce\",\"name\":\"SportDown\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sportdown.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/ab3c95de258cdef60a7cf457cfcff2704d61ba7b8dd665c44c20958eee673a02?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/ab3c95de258cdef60a7cf457cfcff2704d61ba7b8dd665c44c20958eee673a02?s=96&d=mm&r=g\",\"caption\":\"SportDown\"},\"url\":\"https:\/\/www.sportdown.com\/author\/sportdown\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"2022 Wrangler NFR Las Vegas 6th go-round highlights & results - NFR Latest News","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/","og_locale":"en_US","og_type":"article","og_title":"2022 Wrangler NFR Las Vegas 6th go-round highlights & results - NFR Latest News","og_description":"In Round 6, Wright earned $22,851 in saddle bronc riding with a second-place 87-point ride on Bar T Rodeo’s Jitterbug and $22,851 for his second-place 86.5-point bull ride on Four Star Rodeo’s Bit A Bad News. He earned $209,405 at the 2022 NFR. “When you break your record, it means you did better than the [&hellip;]","og_url":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/","og_site_name":"NFR Live Free 2025 National Finals Rodeo","article_published_time":"2022-12-09T23:57:42+00:00","article_modified_time":"2024-05-02T23:58:17+00:00","author":"SportDown","twitter_card":"summary_large_image","twitter_misc":{"Written by":"SportDown","Est. reading time":"16 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#article","isPartOf":{"@id":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/"},"author":{"name":"SportDown","@id":"https:\/\/www.sportdown.com\/#\/schema\/person\/bde5a067801ef53785224c8062eb80ce"},"headline":"2022 Wrangler NFR Las Vegas 6th go-round highlights &#038; results","datePublished":"2022-12-09T23:57:42+00:00","dateModified":"2024-05-02T23:58:17+00:00","mainEntityOfPage":{"@id":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/"},"wordCount":2932,"commentCount":0,"publisher":{"@id":"https:\/\/www.sportdown.com\/#organization"},"articleSection":["News"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/","url":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/","name":"2022 Wrangler NFR Las Vegas 6th go-round highlights & results - NFR Latest News","isPartOf":{"@id":"https:\/\/www.sportdown.com\/#website"},"datePublished":"2022-12-09T23:57:42+00:00","dateModified":"2024-05-02T23:58:17+00:00","breadcrumb":{"@id":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sportdown.com\/news\/2022-wrangler-nfr-las-vegas-6th-go-round-highlights-results\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.sportdown.com\/"},{"@type":"ListItem","position":2,"name":"2022 Wrangler NFR Las Vegas 6th go-round highlights &#038; results"}]},{"@type":"WebSite","@id":"https:\/\/www.sportdown.com\/#website","url":"https:\/\/www.sportdown.com\/","name":"Watch NFR Live Free 2024 National Finals Rodeo Online","description":"","publisher":{"@id":"https:\/\/www.sportdown.com\/#organization"},"alternateName":"NFR Live Free","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sportdown.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.sportdown.com\/#organization","name":"NFR Live","url":"https:\/\/www.sportdown.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sportdown.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.sportdown.com\/wp-content\/uploads\/2024\/05\/cropped-wrangler-national-finals-rodeo-site-icon.png","contentUrl":"https:\/\/www.sportdown.com\/wp-content\/uploads\/2024\/05\/cropped-wrangler-national-finals-rodeo-site-icon.png","width":512,"height":512,"caption":"NFR Live"},"image":{"@id":"https:\/\/www.sportdown.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/www.sportdown.com\/#\/schema\/person\/bde5a067801ef53785224c8062eb80ce","name":"SportDown","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sportdown.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/ab3c95de258cdef60a7cf457cfcff2704d61ba7b8dd665c44c20958eee673a02?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/ab3c95de258cdef60a7cf457cfcff2704d61ba7b8dd665c44c20958eee673a02?s=96&d=mm&r=g","caption":"SportDown"},"url":"https:\/\/www.sportdown.com\/author\/sportdown\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/posts\/65","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/comments?post=65"}],"version-history":[{"count":1,"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/posts\/65\/revisions"}],"predecessor-version":[{"id":66,"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/posts\/65\/revisions\/66"}],"wp:attachment":[{"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/media?parent=65"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/categories?post=65"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sportdown.com\/wp-json\/wp\/v2\/tags?post=65"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}